---
title: StructuralSectionConcreteRectangleCut
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# StructuralSectionConcreteRectangleCut

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BottomCutHeight { get; set; }` | `structuralSectionConcreteRectangleCut.BottomCutHeight` | Double |
| `Double BottomCutWidth { get; set; }` | `structuralSectionConcreteRectangleCut.BottomCutWidth` | Double |
| `Double TopCutHeight { get; set; }` | `structuralSectionConcreteRectangleCut.TopCutHeight` | Double |
| `Double TopCutWidth { get; set; }` | `structuralSectionConcreteRectangleCut.TopCutWidth` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```